preserve
envious
unique
legislators
meeting
show
constituents
fellow
states
session
americans
splendor
spoiled
natural
nation
month
opportunity
maine
special
millions
corn
grains
government
federal
positions
sends
futures
trade
report
slowed
trading
board
soybeans
mixed
grain
stocks
active
chicago
opening
issuance
commodities
holding
attention
steady
byproducts
traders
record
levels
rising
peak
soybean
demand
supplies
attracting
markets
meal
faster
decline
posted
good
advances
fairly
declines
exchange
turned
yesterday
light
amex
american
fourth
outpaced
margin
consecutive
drop
stock
loss
row
force
texans
petroleum
system
cost
amer
ind
alternative
pleased
announcement
cut
praises
service
suggest
decision
credited
revd
research
favor
program
issue
chmn
head
supporters
assn
inst
indus
cities
tariff
present
man
litchtblau
task
directive
approve
industry
action
mitchell
nixon
leaders
reached
sharp
mint
informal
rose
make
cent
silver
content
compromise
congress
million
agreement
gain
sharply
news
coin
spur
eisenhower
advance
dollars
tavern
ikard
evening
institute
companies
met
governors
frank
congressman
washington
quiet
thursday
club
dinner
depleted
largest
president
nov
association
lobby
texas
heavy
selling
liquidation
profit
taking
apparent
driven
complex
speculators
drove
speculative
closes
wheat
commodity
tuesday
dropped
comeback
reversed
stage
copper
observer
bullish
rise
crediting
tight
cuts
output
recent
united
substitutes
leading
friday
results
grinding
dealer
cocoa
compared
wider
guesstimate
quarter
linked
people
recommendation
reduce
revamp
cong
responsive
sen
fails
overhaul
inequities
urges
fight
crude
import
adm
supports
correct
subcom
policy
inflation
scores
brooke
domestice
kennedy
gasoline
heating
foreign
discredited
equalize
small
senator
nexon
shell
group
increased
months
revenues
income
royal
sales
depreciation
reported
dutch
earnings
year
figures
net
total
bringing
cites
declined
december
edge
metal
moderate
contract
seasonal
irregular
set
august
registering
heavily
september
sold
contracts
houses
commission
lows
attained
regains
july
local
highs
ground
bite
early
weather
factor
growing
dip
buying
areas
brews
protectionist
suddenly
community
louder
ponders
japan
avoided
grown
relations
war
hope
european
measures
brewing
possibility
world
ominous
made
strains
economic
conflict
talk
votes
formally
upi
ways
house
means
quota
effect
voted
committee
hold
asserting
rejection
members
notes
muskie
shocked
challenges
recommended
hearings
questions
position
proposal
disappointed
original
retention
worldwide
official
sees
aug
consumers
shortages
hard
administration
increases
aide
ap
rate
rates
result
predicts
fuel
hit
skyrocketing
utility
libyan
nj
conceding
ordered
libya
daily
purposes
affiliates
standard
reflect
govt
production
validity
bbls
units
conservation
efforts
latest
observers
esso
told
gentle
jetliner
buffeted
hijackings
market
heads
descent
territory
glamours
psychologically
dow
strikes
glamour
favorites
stays
entire
average
list
loses
occidental
nosed
downward
minus
turnover
landlords
spring
probe
rent
city
rumors
asks
rigging
housing
due
investigation
inquiry
maintenance
nyc
widespread
counsel
comr
owners
altman
corp
complaints
cos
doubled
bronx
property
impact
runs
street
chain
wall
indonesia
st
sportlight
dramatic
anew
chile
affect
abroad
developments
demonstrated
meets
representative
journalists
richard
views
language
newspapers
editors
experience
hand
ottinger
questioned
closely
press
regimes
dictatorial
wide
major
upheaval
country
began
tax
accord
calling
arab
bracing
announced
expected
costs
company
lifts
marathon
payments
advanced
oats
texaco
agreements
british
ago
howled
winter
flames
survival
remember
days
long
huddled
woe
icy
place
flickering
frail
winds
fireplace
ally
woolies
showed
earlier
reports
unit
firstquarter
enterprise
international
transport
sector
fed
bennett
letters
exec
work
institutionalizing
private
nam
lr
editor
tech
assessment
criticism
raised
pays
move
anti
raises
gallon
fail
follow
bbl
raise
gulf
announces
increase
pressures
add
concerns
forces
successful
scrutiny
gal
offset
slated
silent
dealers
effective
pay
barrel
upward
freeing
temporarily
initiated
incomes
cents
hike
abandoning
back
controls
quotas
start
state
atlantic
beat
leases
boost
order
offshore
richfield
money
confuse
doesn
pieces
dennis
economist
tendency
lid
sir
disillusion
late
certificates
robertson
sorts
heavier
illusion
gave
blow
draw
pressure
lay
trouble
goods
receive
act
sheer
actual
risen
found
charges
profiteering
shortage
attributes
yr
investigators
iran
consortium
proven
royalty
wells
western
wage
propose
economists
inflationary
advisers
moved
spiral
spokesman
curb
council
surtax
adoption
launching
domain
suspend
oli
free
william
urged
immediately
proxmire
resolved
huge
bookkeeping
created
caused
delayed
yield
delay
time
close
problem
volume
minutes
fact
previous
energy
atomic
orders
concern
capacity
graph
delays
labor
laid
fossil
soar
arrives
interest
power
environmentalists
lag
problems
bldg
utilities
opposition
plants
kw
nuclear
shows
strongly
defends
dec
defended
stimulation
vital
steadily
organization
years
fallen
begin
england
antitrust
groundwork
collusion
legal
gens
agree
setting
atty
conf
suit
ban
home
artificially
seek
charging
govs
provided
mar
run
additional
spectacular
assumed
pushing
potent
kets
cheers
thrust
front
financial
prominent
exciting
explosive
pages
finance
briton
traditionally
englishman
influential
outspoken
cautious
london
oilman
lost
halted
dropping
closed
activity
rally
recovered
combination
hour
factors
reduces
large
trimmed
continue
expanding
authorized
imports
trims
losses
speculation
gains
control
development
coupled
upsurge
setback
businesses
nationalism
industries
mil
reform
speed
guerrilla
venezuelan
venezuela
pledges
exercise
interests
recently
econ
part
goals
law
bank
desire
presented
apprehension
stun
banking
social
received
discloses
kuwaiti
emergency
iraqi
int
mohammed
agency
internatl
nations
opec
offer
offers
sec
kuwait
operating
saturday
meet
living
land
caracas
form
venezuelans
foreigners
promptly
chill
asked
boom
passed
tightening
squeeze
bill
manner
prospect
averting
jallud
hunt
conclude
informed
separate
definite
oilmen
producers
talks
deadline
expiration
refrained
answer
drastic
bunker
maj
crisis
maintaining
embargo
eases
ghtful
calls
countries
producing
holds
pahlevi
reopening
disruption
accept
threat
exporting
legis
shah
reptdly
apparently
realize
plan
comment
canada
keeping
sell
unavailable
proposed
min
brown
canadian
discussed
deal
greene
ashland
guarded
controlling
undecided
unresolved
remarks
noted
shipments
refuse
unilaterally
statement
threaten
wks
exporters
weeks
issues
individually
teheran
costly
held
remains
dealing
team
question
refusing
negotiating
sides
pact
compensate
effects
predicted
insisting
assurances
final
size
organize
ed
domestic
raw
hemispheric
aimed
settlement
demonstration
consuming
reducing
imported
encourage
natl
comparable
dependent
comprehensive
tending
produce
groups
rises
win
enormous
surrender
vulnerability
dependence
materials
products
similar
urging
supplier
feb
vienna
showdown
mediterranean
hurdle
expect
freight
arabia
advantage
pattern
arabian
motives
eur
scheduled
algeria
demands
offered
refusal
negotiate
jointly
terminals
reflecting
iraq
term
mkts
differential
saudi
coordinate
obscure
stiffer
bedjaoui
pol
decided
nationalization
france
arguments
surprise
rebuttal
pres
lowest
complete
luncheon
amb
paid
french
decide
algerian
ingratitude
pompidou
gracefully
points
aid
algiers
tankers
pragmatic
gas
partnership
liquefy
pipe
joint
planning
massive
recompress
yrly
taxes
break
deadlock
retroactive
package
reinvestment
includes
obligatory
formula
strong
indications
revised
hopeful
militant
optimistic
softened
execs
executives
dispute
jones
wildcatting
cited
men
number
pumping
consistently
game
drilling
strike
article
percentage
yrs
illus
declining
wildcat
quietly
users
dearer
classic
center
middle
confrontation
nearby
east
events
greater
depend
risk
willingness
metz
sr
discussion
productivity
analysis
believes
facing
britain
edie
performance
simkin
concluded
interruption
turning
supply
relieved
peace
april
finally
hopes
negotiations
consulting
danger
lack
period
api
experts
paralyzed
avg
decisions
revived
statistics
describes
petrochem
noting
basic
mysterious
increasing
authorization
inaction
interagency
complains
mos
corrected
radically
undertaken
failure
step
important
making
reconsiderations
panel
lincoln
practically
materialized
changed
dept
interior
asserts
allocations
situation
called
negotiation
ambiguities
premier
stressing
patience
initiative
gb
entering
delmas
difficulties
candidates
persist
decisive
map
assembly
seeking
feels
reforms
phase
throw
redrawn
dangerous
obstacles
chaban
future
entry
eec
drought
spurred
fears
damage
halved
imposed
office
findings
issued
study
expressed
preparedness
fall
november
roll
bd
quoted
point
japanese
pushed
export
liberalization
revaluation
yen
approximately
hastening
capital
amounting
firm
choice
fuji
credits
relaxation
exch
preferential
developing
accelerating
pace
orderly
survey
tariffs
heels
slump
rallied
broilers
iced
burn
police
student
clash
striking
bus
drivers
activists
stop
vehicles
majority
protest
warning
manila
join
jeepney
operators
written
persian
detailing
diameter
pacific
tons
ussr
estimated
port
constructed
parley
provide
construct
nakhodka
inch
circles
intend
quantities
irkutsk
material
tyumen
coast
construction
slates
loans
discuss
siberia
steel
pipeline
valued
tokyo
fields
mo
mi
project
venture
tubes
soviet
short
covering
expectations
crop
soaring
half
climb
bushel
full
orgn
assets
concessions
initial
share
existing
territories
reserves
profits
mgt
beirut
sept
participation
el
moudjahid
require
tripoli
newspaper
paper
fundamental
tehran
combatant
revision
operations
elec
bar
musicus
interdepartmental
series
bids
telephone
pub
freeze
current
cutting
comm
solutions
psc
studies
pending
indepth
finds
exists
confusion
travel
float
dollar
range
air
psychological
ny
trends
maintain
traffic
analysts
enthusiasm
ou
times
showing
spurring
businessmen
shortened
civilian
franklin
roosevelt
cope
post
fractionally
slight
direction
lacks
witnessed
desultory
exchanges
holiday
open
produced
attracted
register
sending
edison
rollback
electricity
consolidated
granted
june
customers
checking
commercial
residential
temporary
cases
con
marketers
basis
fluctuation
penny
transformed
declares
dir
subject
bulk
narrow
moving
bounded
picture
promise
buildings
abandonment
legality
verge
investigating
watchdog
bankruptcy
real
homes
estate
apartments
reductions
leave
level
estimates
households
fraction
substantially
tompkins
athabasca
prospects
scale
tar
area
broad
sq
rev
ne
expansion
conservative
synacrude
provincial
sand
miles
sands
alberta
progress
view
prove
compensation
devalued
equity
role
fear
marketplace
playboy
bounds
shares
enterprises
public
sagged
quick
bunny
francisco
jackson
san
uncertainty
ending
sources
henry
north
establishment
concerted
geneva
devaluation
de
reprs
jan
adverse
facto
hints
advisory
rents
represent
warns
integral
apts
proper
assured
objection
abandonments
regulation
parts
controlled
viewpoint
hr
freezing
criticized
protection
tenant
bldgs
prior
contolled
tenants
arbitration
giants
industrial
plans
woes
requesting
isolated
seizure
brit
beset
incident
rash
lagging
worries
delivers
faulty
properties
owed
debts
bearing
contribute
owned
ins
brought
empire
trustee
satisfying
la
acts
apptd
lake
payment
note
appears
vast
ct
louisiana
remaining
prepaying
recommends
lend
mecom
southern
delivery
date
reorganization
salvaged
subordinated
tex
independently
prudential
signal
recognized
purchase
reorganizes
salvage
creditors
mining
tv
revalued
sale
bolivar
radio
caldera
revalues
gaining
confidence
relax
socialist
rule
baghdad
baath
stern
party
firmly
beginning
regime
product
repeat
petroluem
routed
replay
operation
adjustment
dividend
california
totaled
independent
search
exploitation
incentive
continental
exploit
america
stimulate
nationalized
hurt
reversion
ruling
outcome
hydrocarbon
resurges
vp
officials
kuan
nyse
index
industrials
floor
howland
hsin
communist
yung
blocks
brisk
hsi
wave
visitors
china
abound
hsu
lang
mrs
tour
hung
chang
fuels
humble
pared
warmer
refining
subsidiary
sulphur
reduced
jersey
usual
warned
drake
chief
chairman
ownership
push
oilfield
eric
cumulative
adopt
charitable
overwhelmingly
annual
political
defeated
socal
proposals
regular
limit
stockholder
disclosures
voting
contributions
getty
facilities
nationalize
representing
abdulla
tariki
rights
waters
delegates
sheik
firebrand
cheering
calm
peoples
troubled
eighth
resources
minister
hundredths
mercantile
fowl
disease
toll
dozen
egg
bought
customer
don
fair
ll
philosophy
broker
call
brokers
test
investor
compagnie
buy
won
francaise
foreseeable
deters
identified
paris
kirkuk
petroles
des
stalled
staged
feel
obviate
vitally
clauses
profitable
built
crises
intends
interested
split
stable
opens
contrasting
focuses
focusing
longer
shock
mutually
periodic
indication
policies
embarassment
obtained
royalties
producer
west
cheap
meaning
doom
respond
purchases
chinese
score
purchased
response
popularity
profitability
argus
breakthrough
improving
upside
services
wiesenberger
conclusion
shown
ltv
jpjohn
loan
firestone
sizable
savings
banks
spearheaded
stepped
plunges
leasco
tanaka
kakuei
send
cotton
hearing
cts
felt
intensifying
impel
attack
exist
doubts
security
dissatisfaction
conditions
engine
pratt
develop
previously
usn
usaf
awarded
addition
fighters
defense
whitney
receives
div
oct
aircraft
considerations
serving
accuses
mcgovern
challenged
affected
dakotan
progam
proposing
aids
expense
mechanics
prowess
collectors
revenue
distinct
lebanon
influence
mideast
completion
houston
iranian
corporation
national
systerns
signed
beaded
lift
repts
lists
qr
life
soaked
rain
deliveries
sugar
lands
continuation
ecology
find
synthetic
conventional
storage
comments
reliance
priority
source
speech
pleading
confronting
inavoidable
gap
inevitable
rationing
balance
hardesty
capability
substantial
exploration
risks
discusses
reason
main
impelling
round
ofcontract
rept
offering
rejects
considered
reject
atioi
thereof
al
separately
difference
mkt
submitted
key
snags
authorities
rice
types
polaroid
breather
finished
indicators
kodak
history
building
plywood
depresses
biggest
possibly
wild
hectic
story
hurts
consumer
dramatically
pocketbook
weighs
kenneth
executive
director
pass
department
message
forthcoming
steep
confers
flagging
electric
invariably
equally
eastern
region
strange
rich
inside
relationships
europe
smaller
union
globe
testing
sounder
examine
contracted
iron
frontiers
bamboo
spirit
bigger
europeans
outset
hinted
ease
contributary
refiners
relaxed
diverting
distribute
channels
amerada
uninterrupted
confirms
rrs
buyers
hess
diesel
virgin
midwest
premium
truckers
repr
refineries
discouraged
shift
islands
sgro
importation
introduced
guide
urge
exxon
mood
permissive
guidelines
easier
failed
excess
workings
mobil
cautionary
raising
shut
chiefly
coal
stockpiling
starts
protect
capabilities
interrupted
started
acting
stockpile
disclosed
begun
switch
boiler
intended
wholesale
irs
evidence
books
shultz
violate
diplomatically
ger
financing
express
protests
informs
believed
commits
expires
primary
recd
intention
germany
preparing
double
sought
concession
spain
requiring
upstandby
introduce
submit
develppments
negotiated
gov
noel
distributors
island
assertion
amoco
obtain
anxious
rhode
jr
suspended
governor
suspension
documented
indefinite
ri
medders
enforced
alternatives
trust
implausable
forced
lekachman
tame
permanent
prof
approach
method
economy
victims
monster
nature
biases
accepted
cartoons
busting
recession
machinery
corporate
outlook
opened
car
briefs
representatives
hauge
peterson
peter
makers
australian
emissary
weaker
excessive
challenging
gold
hordes
scene
underlying
provoke
elements
weekly
renewed
instability
monthly
review
ounce
compelling
justified
nervousness
eventually
currencies
irrational
importance
monetary
demonstrate
spree
grips
grave
distrustful
represents
uncertain
bankers
allure
values
comparisons
scare
precipitated
streak
breaking
outnumber
summary
succeed
thecounter
losing
drops
weighed
limitation
mandatory
curbs
farm
situations
refinery
put
covered
reimposed
meat
reportedly
republicans
denied
hoot
farms
foreclose
agricultural
white
applied
inevitably
metaphor
closet
tougher
stressed
labeled
punitive
stick
swing
dunlop
reimpose
john
misnomer
discount
clout
monday
claim
stabilization
graded
weight
remained
reasons
vary
competitive
quality
revs
cheating
farmers
opportunities
geographically
causing
black
virtually
extensive
sort
halt
induce
assert
bidding
needed
soared
reconsidering
king
animals
impose
agr
mktg
drawing
stress
rr
deregulation
incentives
standards
environmental
achilles
scope
heel
totally
surrendered
handed
injured
passengers
death
central
cuba
carrying
train
river
killed
derails
account
biu
love
adams
personal
banker
denver
seat
collect
bestthing
kill
opposed
shutdown
permit
accounts
ing
eugene
cars
mississippi
bp
panhandle
corportion
boycott
live
distant
change
cattle
rumor
unconfirmed
dependency
arising
amouzgar
mission
aims
thing
legitimate
obscured
falsified
side
strength
livestock
beef
apr
hogs
indicating
trend
reflects
widening
inches
floods
dumped
snow
blizzards
flooding
continued
prires
swept
metropolitan
fire
terminal
saida
trans
sabotage
south
quotation
suggested
division
coffee
pound
maxwell
toyota
general
foods
spread
beans
motor
sets
coffees
retail
manufacturer
recess
end
exploratory
resume
cairo
sessions
incurred
troops
vietnamese
column
refugees
cambodia
hundreds
field
vietnam
cease
cambodian
fighting
border
fled
page
akins
govts
favorable
italy
expert
noncommittal
support
wars
drafting
allocation
foresees
consultation
purpose
ambivalent
importing
avoidance
event
principal
articles
displaced
terms
saudis
wary
mastery
marketing
slashed
outlays
algerians
shifts
enlarged
arrangements
paradise
broken
investment
projects
paradox
accompanying
coping
overview
colossus
smith
rest
hot
plenty
amid
crash
brownouts
blackouts
spend
decade
physical
wagon
tank
stations
assemblies
volkswagen
gasolines
passing
considers
tenths
capitol
diplomacy
geopolitics
regarded
sheiks
quaker
foremost
tunes
york
palaces
rooms
background
james
mercedes
top
hill
reinauer
overreacting
conservationists
rotary
bros
withdrawn
contrasts
chides
recommendations
distributor
detriment
deplored
speaking
cahill
ton
advancing
prevent
fixed
belief
contractors
buffer
fixing
fix
formed
watch
stayed
cooperate
fee
including
competition
removing
provoking
cartel
makes
adelman
give
visit
creation
attitude
opposes
counterreprisals
create
bargaining
politization
passive
bloc
cooperation
scored
keynote
favored
jamieson
mutual
address
accommodation
shortly
bilateral
reprisals
nakasone
oppose
avoid
stratagem
taylor
miller
parakeets
desfensive
vote
disturbing
combat
destroyed
apologetic
reading
achieving
highway
myth
attempted
explanation
wesley
letter
schools
tammany
teacher
intolerably
school
save
fund
professor
commenting
avgd
reporting
reptg
base
prvious
agreed
demanding
rejected
torise
option
limits
bu
permissible
options
purchasing
member
ended
minor
belgium
runaway
compa
dominant
ordering
contributed
alan
ernment
nies
ofgasoline
ward
barrels
motion
threatened
numbers
comforting
sanctions
avert
schedule
qaddafi
appeared
differences
hrs
impasse
agreeing
broke
signalled
formulas
rapidly
computed
measured
yields
fluctuations
intensify
curtailed
ahead
crusader
jurisdiction
arms
claimed
fired
helicopters
jet
army
officers
access
umm
bubiyan
channel
killing
tanks
qasr
line
alert
stresses
naval
demarcation
neighboring
mediation
warba
procurement
accelerated
crossed
pulled
repair
rubber
retreading
tire
sizes
automobile
auto
tires
truck
retreaded
rods
goodyear
brass
ii
phases
intervention
direct
common
overcharges
refunds
releases
tentative
violation
required
signals
rolled
filling
station
steps
exceptions
requests
dozens
rollbacks
restitution
israeli
arises
dominate
inter
inhibit
cash
realities
disputes
rivalries
dangers
attendant
translate
cartoon
reserve
status
secure
relationship
khene
suppliers
actions
spotlight
lesser
suggests
individual
accustomed
struggle
helm
dr
gen
viola
assume
attitudes
arrogant
alleviate
politics
condition
stringent
granting
rules
brings
comparatively
budget
leniency
pricing
balanced
lenient
revisions
grow
tighter
staff
passes
food
recorded
meany
leads
fastest
korean
conference
wednesday
significant
innovative
tie
washinton
lebanese
midnight
zahrani
refiner
mine
equipment
sidon
averts
caltex
mederco
averted
minute
restrictions
amoseas
intensifies
pro
stockholders
israel
employes
soften
aspirations
restricts
foster
intent
repurchase
overseas
appeal
calif
barrles
ceiling
listings
ceilings
markup
octane
conform
adjusts
grade
sun
delhi
grades
decrease
sweet
okla
adviser
stein
mr
herbert
sight
lose
drive
governing
coming
accords
pacts
tearing
northeast
deceiving
normal
generally
inventory
release
inflated
parallel
feared
plant
smelter
site
pine
arkansas
build
bluff
acre
cerro
ark
emerging
arabs
faisal
strategy
past
attempts
recalled
denunciations
campaign
shafarevich
mathematician
correction
igor
physicist
andrei
joined
intensive
credit
sakharov
writers
signs
russian
inspired
pleaded
officially
scientists
denunciation
permission
libyantake
modify
alter
intensification
weekend
presaged
arabisrael
diplomats
pledge
kissinger
giving
israelis
kindle
highest
likelihood
welcomes
models
bulge
rehnquist
verification
clears
ranging
termed
arbitrators
treas
planned
shipment
diverted
requirements
denomination
scaled
matters
deposit
removed
denies
unclear
displeased
domestically
highly
negotiator
escalating
dissatisfied
face
hammer
yamani
imperial
unusual
counter
indexes
differ
consensus
lagos
ministerial
deteriorating
nigeria
revise
foundation
exports
causitive
hopkins
experiencing
sufficient
johns
forecasts
ties
lichtblau
univ
seminar
amounts
permitting
permitted
returned
transactions
slightly
marked
winning
hours
lot
rallies
firmed
odd
fronts
examines
exemplified
seymour
mounting
unmitigated
reluctance
exclusively
muammar
illustrated
collectively
takeover
col
cordial
qatar
dhabi
evident
tension
injects
dead
element
participants
abu
represented
preceded
editorials
counterattacks
family
egyptian
amusements
arts
lines
style
sports
airfields
obituaries
military
syrian
launched
weapon
ministers
prepared
urgent
contact
determine
debate
propane
kerosene
sohio
notably
portion
ohio
allowable
collapse
afford
implications
bid
spokesmen
request
concede
ignore
shutting
assumption
wk
invited
recesslignored
agnew
nominate
minority
spiro
vice
gerald
ford
text
presidency
leader
slope
fragile
alaska
mistakes
disasters
vulnerable
superior
probable
fron
environment
potential
environmentally
soundness
details
critics
arctic
unstoppable
repeated
poses
amt
rush
scars
route
variety
slpe
explore
leaving
convince
critical
valdez
permafrost
unconnected
effort
tied
viewed
threatens
target
unfriendly
tonight
modest
reduction
expectedeffect
burden
exempt
proclaimed
edged
economies
sword
foreseen
extending
stockpiled
parliament
ration
anticipated
offices
coupons
cutbacks
word
averages
dislocations
cutback
seriousness
namuj
goadby
havoc
escape
hn
convinced
analyst
governments
uneven
stunned
diplomatic
exacerbate
resentment
assayed
treatment
refined
privately
wassily
chosen
patrick
writer
leontief
nobel
born
harvard
prizes
novelist
honors
egypt
syria
shipped
sounding
thousands
paying
regulations
rescue
pressured
taste
absorb
stevenson
adopted
percy
pump
sens
dominici
allowed
legally
outcry
weakens
mcintyre
provision
eliminate
authorizing
conferees
named
amended
amend
section
unfair
barring
nullify
ftc
greatly
sponsor
enforce
congressional
stripper
caribbean
sidestepped
cen
leum
petro
wake
terday
economics
legislation
shelve
rockland
based
january
rockefeller
county
released
estimate
bills
activate
tone
played
predict
resistance
revival
mechanism
quickly
deficit
embargoes
allocate
requested
play
return
activation
gloomy
abate
lifting
apportion
appraisals
lignon
midwinter
unified
dim
industrialized
relief
destroy
rescind
austerity
rivalry
listed
prime
partial
climbs
continues
mines
mid
dome
cyclops
slide
plummets
rolling
lowsl
chase
working
warnings
belabored
society
heat
residents
doled
bankruptcies
managers
beggar
process
pointed
slowing
roughly
effectively
competively
growth
directly
overheating
worrisome
creating
closer
existed
gatt
endurance
flying
cooling
butcher
forecast
oecd
absence
squeezing
disrupt
manhattan
simultaneously
horizon
perils
uniformly
distort
neighbor
running
landing
cushion
bumpy
econs
rampant
cycle
fiscal
aggressively
responding
applying
jettisoned
thy
decades
overkill
pockets
dealt
implement
politically
bahrain
dubai
netherlands
mm
por
tracking
bring
atiqi
abdesselam
evaluating
equitable
uncertainties
induced
stirs
plummeted
devoted
activities
processes
repercussions
studied
citing
fewer
unity
solar
speeds
race
chancellor
temps
canceled
readying
bonn
distortions
voluntarily
powers
conserve
germans
engaged
shore
relation
manipulation
oddities
doubling
feeling
earning
chaplin
dark
breathless
desperately
speeded
completed
capitals
mind
prop
rushes
charlie
images
movie
secretary
collapsing
road
islam
pessimistic
unsatisfactory
concept
produces
suggestions
argues
orinoco
strain
alfonso
perez
belt
cleared
salvia
depletion
emphasis
maximized
usage
guarantee
propitious
exporter
speeding
proving
properly
affording
considerable
involve
realized
benefits
maximizing
transition
challenge
expanded
revert
reviews
defined
phrase
waste
discourage
rely
efficacy
excise
consumption
attacks
credibility
taxation
extensively
controversy
regressive
experiment
pursuit
morton
fairer
box
bebe
hughes
voter
gift
howard
rebozo
horror
stashed
stories
hubert
fresh
humphrey
limousine
bombards
detailed
signing
sign
carry
mins
witness
jobert
treaty
tube
guaranteed
douglas
frethun
consisting
separated
ends
billecoq
rail
authorizes
historic
cheriton
tunnel
heath
pompidon
consortia
english
chequers
koreans
briefly
adjourned
turkish
die
cabinet
unable
resuming
refuses
freighter
burns
ref
george
piercy
load
deciding
grossi
spent
backed
measure
applicationssenate
wallhouser
ozzard
responsibilities
resignation
schoenwald
funds
understaffed
regulatory
worked
comrs
salary
underbudgeted
rulings
wallhauser
aim
mandating
pension
opinion
justify
lougheed
great
enable
hesitation
methods
provisions
syncrude
involved
reach
ottawa
approving
extraction
scott
geologists
invest
confronted
recoverable
abdessalam
lifted
exemption
missions
palestinian
explain
withdrawal
declaration
timetable
occupied
agrees
restoring
repercussion
toughness
denise
accelerate
continent
trouvain
chevalier
predictions
gerst
textile
univer
assuming
suffered
banque
friendly
insulated
swiftly
curtailment
grenoble
resumed
classed
bas
flow
deutsche
shipping
severe
mathysen
curtailments
alarms
projections
climbing
keating
lighting
risingtemperatures
bureau
october
transportation
primarily
colombia
peruvian
ecuadorian
supplement
spans
corner
prolific
regions
northwest
peru
sections
colombian
ecuador
jungle
sharing
presently
initially
consumes
consortiums
seemingly
amazon
involving
hospitable
extension
feasible
andes
pressed
promising
discoveries
laws
unwelcome
fueling
alive
extent
reminder
unprecedented
happened
blame
expenditures
refutation
candidate
deputy
transit
amers
attributing
autos
seller
moment
matter
quarles
mass
reordering
scapegoats
obvious
unrestrained
epa
admr
movement
inamura
negotiators
colleagues
authon
tough
exchequer
attend
estaing
artigny
unofficial
currency
giscard
chiefs
barber
chateau
learned
schmidt
steering
unabashedly
ahmed
tap
riyadh
son
admits
likes
arabiasheik
judge
religious
zaki
favors
objectives
levying
mild
tells
pocket
daysmore
yielding
breaks
ribicoff
appeals
rhodesia
vorster
reacting
africa
warn
african
panic
reserved
promises
authority
consulted
plead
transferrable
absolute
gradually
apparatus
compel
negative
passage
pasadena
speaker
evaluation
christmas
conclusively
albert
residual
rations
allowing
necessity
consideration
convert
avoiding
municipally
adjournment
burbank
stopped
suggestion
glendale
arrive
gimbel
consent
decree
ontario
powerful
sheet
composition
disclosure
plowed
backing
idea
limiting
possibilities
windfall
controversial
expand
allowance
va
cambridge
gals
absolutely
lock
deplores
bound
upsets
highways
arrests
contending
roads
lanes
costing
haulers
tractor
blockaded
blakeslee
edwards
salaries
bresnahan
teamsters
conn
bartonsville
employed
nonunion
interstate
jobs
nationwide
driver
park
renegotiation
reptd
membership
rigs
fitzsimmons
haven
halting
trucks
cover
trucking
fraternal
penna
del
trailer
block
lowers
introducing
simon
reseller
programs
reporters
cooperated
plummet
dist
sensitive
outgrowth
anxieties
worst
withdraw
suffer
extremely
underdevloped
surplus
developed
kind
proposes
domination
carried
dominated
era
tanzer
coordinated
poorly
ecological
case
conspired
failing
combinative
advised
allegations
outlets
tradeoffs
unrealistically
practices
disquieted
maximize
disincentive
decreased
adequate
hume
setbacks
unknown
anticipate
predicting
li
fairfield
instance
connecticut
pinch
westchester
reality
quantity
code
continuing
spiraling
boilers
competitors
frantic
barge
encounter
yaari
simple
inducing
expounds
resist
scarcity
slow
driving
phenomenal
arrest
absorbed
resulted
curtail
invite
stance
sacrifice
blackmail
minded
mushrooming
irrelevant
enacted
sound
coalition
scoffs
assure
shmuel
logic
provocative
profound
spending
businessin
calculatedly
internal
suggesting
businessman
left
economically
movements
easily
commons
pierre
loyal
trudeau
helps
elliott
portugal
colder
faces
hardest
slowdown
shorter
switzerland
sweden
lives
temperatures
greece
wintersince
norway
difficult
salomon
exceed
fetched
insts
absorbing
speculates
interim
thinks
inflows
techs
capable
compares
brookings
reviving
inflow
theory
krause
desired
reap
anxiety
englert
slumps
securities
turn
cure
greatest
exchs
investments
valves
vivid
achieved
senate
bad
searching
signaled
stimulated
sense
argue
urgency
impressive
outbid
scurces
eared
auction
appreciably
india
affluent
indian
reassurance
proram
poor
begins
hurting
dominates
modern
disposed
boumediene
lies
peasant
shelters
withholding
include
eimei
recation
yamashita
devastating
honks
grudges
seats
cancel
shelley
snobbery
space
investing
subsequent
sky
airlines
occupy
flights
affecting
speeder
tourist
equivalent
maintains
contends
poverty
watt
class
thrift
aboard
forgotten
rightness
merrill
dumping
lynch
charged
bolivia
rca
usury
advertising
disagreement
traveling
senior
ironed
procedural
resource
mills
cheaper
names
operated
aware
intense
golden
ppg
ad
flawed
kunstler
iv
engineer
court
culprit
airborne
eggs
bruckman
ample
hoffman
emission
impeachment
harmful
fallout
child
rds
poisoner
remove
disorder
stockmarket
portland
missouri
erodes
eroded
mentioned
table
levy
pricd
semchestnov
exaggerated
moscow
published
honor
ruled
takes
bowles
suffers
successfully
chaos
taxpayers
responsibility
shared
margins
eroding
resold
adds
worsen
chemical
asian
petrochemicals
fertilizer
starting
stripped
bowing
designed
modified
approved
duke
attorney
ligon
indefinitely
robert
fights
philippine
shelved
bork
reasonable
aides
citroen
sells
postponed
peugeot
surcharge
skeptical
confused
cross
supplementary
suburbs
slowly
ints
correspondents
existence
guy
bitter
skepticism
edict
adjourn
punished
terrorists
lunch
discussing
compliance
extra
civil
stolt
alleged
discriminated
gaps
lund
encouraged
information
monitoring
managing
nader
hoarding
responsible
exercising
vol
charge
branch
spitz
judgment
flynn
altered
assigns
blames
understanding
persons
filed
petitions
refused
procedures
conducting
fraud
surrounding
larger
complaining
conducted
asst
cooperating
discontinued
stem
decreeing
mark
marginal
ripple
sunday
folowing
petroleumproducing
answers
recessionary
deficits
painful
dull
falls
mahrouk
isolate
communications
disappointment
learning
approval
expresses
rifai
keidanren
deepen
worse
schedules
attempt
figure
johnson
tend
apply
retracts
benefit
ghana
liberia
prompted
chad
internsified
coasts
deposits
thought
phillips
compete
widens
technician
niger
tanker
cameroon
eurs
disaster
weaknesses
ploy
flows
complications
brinkmanship
realization
recognition
harvests
harvest
unfavorable
consequence
korea
seoul
kim
partners
league
laying
manage
submits
host
draft
radidly
foundations
outisde
macdonald
frozen
premiers
montreal
arrangement
afraid
rebuilding
alliance
desires
movers
leak
elaborate
commitments
balances
contributing
waned
strengthen
disaffected
qadaffi
diversification
equation
sadat
liming
recede
feeding
tactics
attempting
difficulty
investors
tumult
optimism
vineyards
bows
toasts
tomorrow
taiwan
eyes
profs
science
stauffer
allied
mckie
saudia
mikesell
burnham
discontent
revolution
reservoir
lewis
astronomical
quotes
dislocation
endgame
pect
indians
pros
unnecessary
pits
unchanged
pit
noon
parliamentary
gained
golda
crucial
elections
likud
dominating
parties
rightist
meir
balloting
february
march
offsetting
ability
transfer
projected
poorer
items
inability
shaken
ef
justed
lowing
nesia
adjust
fective
fol
indo
tc
retain
improve
motorists
watered
soars
metals
strategic
proves
campbell
hedge
hecla
bonanza
red
rebound
regard
aloft
asa
inroads
precious
homestake
rare
outperform
barely
golds
bullion
ultimate
repeating
stages
traded
constitution
opposite
radiation
addicted
exact
paradoxical
lb
blended
wellman
brush
alloy
rounc
recover
beryllium
handicapped
gouger
sues
oilprice
suicide
persuade
depression
band
ch
discrmination
accommodations
homosexuality
priorities
plight
employment
expensive
christ
discrimination
lone
chs
banning
pennies
lounsberry
milton
caucus
gay
psychiatric
wasted
beame
definition
homosexuals
citizens
contradiction
clemente
unlimited
promised
enlisted
depends
threatening
rivals
aspects
acclamation
acclaiming
reaching
watergate
chicanery
knowledge
allegedly
affairs
indispensability
unacceptable
removal
vis
politicians
expertise
democrats
finding
righteously
abhorring
skyscrapers
sheaf
ills
rushing
gleaming
carefully
haunted
expose
atop
pervades
spector
specter
ash
generating
pressing
wastes
electrically
heated
infant
strewn
perplexing
trials
underlies
troublesome
plagued
harshly
stares
array
insure
pakistan
pakistani
redeemable
bonds
explained
broadcast
socialism
recoup
mubashir
efficiently
unaffected
hasan
nationalizes
burning
headed
obsolete
navy
lifetime
ship
stratton
armed
narrowed
standing
powered
restricted
hyman
elmo
ships
bolstered
weapons
submarine
arguing
outlined
samuel
zumwalt
rickover
wiser
versatility
proponent
argument
advent
advocates
fleet
financiers
cynical
joke
simply
corporations
rounds
pounds
german
rushed
marks
swiss
francs
shrinking
tripling
heller
perry
chart
jump
triple
walter
dialogue
consultations
relate
glut
arrangments
ensure
competing
weigh
grounds
canal
suez
separation
bypassing
weighted
izzidin
reference
commissions
armaments
amouzegar
orgin
error
mabruk
newly
intrinsic
jamshid
alignment
strenthening
colorado
tract
surface
unexpectedly
colo
arouse
strip
cameron
neary
layers
russell
trillion
contained
underground
indiana
lease
shale
complicated
varying
pilot
rocky
rogers
mts
amts
rangely
quadrupling
door
communique
hinges
stability
oilexporting
hinged
precise
summer
strengthening
true
principles
sudden
floating
goal
imf
unrealistic
achieve
rome
doubt
convertibility
reformed
adopts
shifted
partly
principle
valuation
structure
thrown
evolution
ratification
stand
sdrs
settled
numbered
dates
voluntary
license
lauds
oregon
mccall
tom
plates
treated
rebounded
directed
media
counterattack
kemezis
stretching
plentiful
meters
se
objective
paul
gac
uyl
cu
sacrifices
confronts
lip
initiating
conferences
reveals
exception
foraging
theories
disparity
alleghenies
levies
amendment
traditional
shattered
sherman
arthur
lowering
forms
instruct
monopolistic
variable
guarantees
mondale
independence
affair
easing
proved
institutional
fenner
reflected
spurt
disrepute
fillip
rarely
owning
prosperity
indifferent
subsided
volatile
asset
weakness
led
portfolios
occurred
resurfaced
rationale
enhance
bounding
brokerage
receipts
pierce
dines
surprising
equalization
surging
bet
depository
lever
respectability
imaginative
initiatives
leadership
related
sit
nonferrous
relies
wilson
retailers
links
approaching
unemployment
raging
describe
deep
minimum
impossible
contractionary
fellner
prosperious
murky
choose
deepest
explosion
puzzled
react
volcker
instinct
quadrupled
newness
branching
bewilderment
consequences
minds
remain
frictional
universal
hugo
denying
teld
slower
couldn
contrast
weakest
faced
restore
swings
emminger
orientation
stronger
devised
staggering
deflationary
excessively
otmar
fred
trigger
weighing
hirsch
deputies
reformers
establish
overhang
stagnation
experienced
tactic
design
wrecked
global
solution
witteveen
aggravated
resulting
disequilibrium
slash
abandon
devaluations
forcing
nairobi
impending
denial
sinks
petrofina
escrow
barred
eximbank
systems
lenders
pick
zaire
upwards
funnel
borrowings
positive
lending
borrow
easy
basket
gouge
francis
spigot
assails
testimony
philadelphia
sargent
subcommittee
freedom
hoards
intergovernmental
manipulate
massachusetts
defer
appealed
apartment
publicly
soc
scandinavia
shortlived
meetings
uneconomical
hiting
wrong
arrow
treasury
unmanageable
technion
naive
encampment
television
jerusalem
cairosuez
tent
afterward
chrges
anwar
enter
hafez
confer
damascus
aswan
disengagement
assad
tracts
leasing
lee
similarly
rental
federally
roncalio
accepts
commit
metcalf
stablilize
teno
extracting
extract
armand
justification
brutality
dying
prisons
oceans
questioning
steiner
job
impeachable
offense
reply
explains
lehrman
alleging
interview
pricel
voices
gross
slumpflation
miscalculated
stagnant
crawling
scheduling
data
mapped
compare
posed
platform
trauma
horrendous
tackle
shortfall
overwhelming
confusing
franc
irish
lira
pointing
northern
workers
extremes
dire
debtors
fourfold
stiff
milk
democrat
wilbur
inevitabilities
inevitability
assisted
sheikdoms
twin
amply
oilproducing
facts
maindenberg
floated
object
unfazed
posts
offand
nearing
cool
helped
unpublished
briefed
trip
congressmen
rifts
deutschemark
segments
brightens
snake
cape
accused
cod
jumped
tests
vapor
fills
californiia
sacramento
managemnent
geothermal
geysers
blake
recovery
ranks
shelf
geological
canyon
plateau
basin
baltimore
greenawalt
onset
interpretations
lottery
statistically
illegal
betting
belong
equal
strauss
propaganda
assess
kent
peddlers
foolish
otb
women
conflicting
pemex
mexico
nervous
irony
hydroelec
contemplating
reassuring
mex
sufficiency
tourism
indirectly
varj
provinces
ich
isruptions
exam
cana
disruptions
ce
onal
im
sting
ister
struptions
improved
unworkable
included
rand
ingersoll
accounting
bars
poorest
defect
crushed
sponsored
contribution
administradion
abruptly
organizers
friendship
riad
mahmoud
legislative
single
encouraging
excerpts
ciritical
fumes
stricter
seeks
automobiles
plow
interaction
attach
popular
clear
depiction
differs
ideal
plowback
negate
careful
supporting
documents
allegation
declassified
multinatl
secret
cartels
newsday
church
voters
mahon
obliged
concludes
adventures
surly
irritation
earth
missed
awkward
concerned
mcnamara
wayne
frustrated
ibrd
impounds
hays
reston
hostile
soft
reacted
appalling
secs
disillusioned
bemoans
starvation
persuaded
condemned
ida
files
inouye
faith
handle
closure
tripled
investigations
proliferating
handling
focus
daniel
mansfield
petition
claims
probes
layoffs
democratic
select
blocked
disclose
instant
corps
trace
launch
holdings
returns
converting
pegged
adding
muntasser
auctions
tunisia
instituted
leaks
auctioned
sealed
recognizes
attributable
omar
independents
proprietary
eventual
franchising
introduces
backs
brazil
australia
eating
eats
dietary
habits
argentina
giant
retained
renault
manpower
automaker
efficiency
ducing
works
engineers
wins
soviets
modernize
siberian
marketability
wisdom
retaliation
quintupled
regain
outflows
borrowing
denominated
ralph
relative
financings
eurobonds
bond
traces
saul
feed
devries
latin
attila
dragoslav
hungry
karaosmanoglu
avramovic
examples
baneth
barend
stanley
jean
debilitated
mously
enor
ninenation
weakening
downgrade
russia
pun
knew
happening
senatorial
indignation
miracles
insolvency
reporter
notebook
individualistic
aires
buenos
argentines
calloused
optimistswas
endemic
heading
toughened
mankind
perfect
mathematical
pre
klein
lawrence
equations
incipient
technique
moderately
expects
linking
verses
behest
flattening
founders
link
happen
slowdowns
keith
model
resolve
interlocking
patterns
rewards
restrain
elimination
pointless
adequately
unbalanced
industrialization
receiving
disrupted
disturbances
crippled
ethiopiafor
commoditieswas
ababa
buoyant
upturn
depressed
dashed
addis
minerals
mile
bridges
manifold
thoroughfare
sunken
century
lesseps
clearing
onlyegypt
commerce
wrecks
reopen
debris
crumbled
digging
waterway
realigning
marvel
boundaries
fortune
indicator
widen
alyamani
pledged
answering
talking
buttradeagency
appearance
cbs
arriving
essential
amounted
metric
yamini
abundant
emerges
rapid
weakened
frankel
alternate
subside
rotterdam
relaxing
populations
journal
bolsters
exploited
speculate
divs
stabilize
prompts
warm
emirates
unusually
emperor
hirohito
ill
administrator
homeowners
treat
equitably
registered
improvements
swearingen
guaranty
terminates
recovers
outflow
morgan
termination
hoped
ranking
worried
unchecked
besancon
mfg
eliminated
doubted
senators
mike
peril
eastland
vows
lessen
assistance
hugh
greeted
jacket
overriding
health
attain
welfare
multilateral
attaining
check
harold
retiring
totals
replacing
haynes
otto
declared
cor
testifying
bungling
faults
schuler
complained
genoa
slush
policemen
magistrates
bribery
conspiracy
bribed
freezes
desegregation
weinstein
transferred
coney
twain
jhs
safety
jack
unjustified
children
yorkand
foresaw
jobless
resident
economize
statements
ensumers
brighter
ew
flowing
clouds
plentifully
forecasting
brussels
rhetoric
wishful
reins
gouging
anachronistic
simplistic
exorbitant
scandals
rudderless
adrift
wracked
vantage
undermined
diminished
thoughtful
moral
perspective
depicts
menshikov
replies
illegality
insular
unlawful
reprieved
railroad
locomotive
locomotives
coalburning
restriction
lowered
firmness
upcoming
enlist
stall
advancement
earn
dilute
expressing
inundating
dealings
sentiments
desperate
divert
technology
supporter
exchanged
enemy
tel
zone
pull
artillery
headquarters
aviv
accordance
egyptians
nightfall
syrians
casualties
sketches
budgeted
undertaking
lobbying
wollstadt
reorgn
instrument
forging
effectiveness
strictures
facilitate
rigid
maximum
substitute
en
saving
darkness
parent
nys
helen
vandermusten
daylight
lisbon
repeal
pollutants
emit
consultant
motivated
sheikdom
comparison
contention
calculated
averaged
contemplate
fashioned
rebuts
corrections
miners
walkout
presents
violence
mandate
perpetuate
ortoli
leaves
regional
michel
cooperative
retaining
xavier
francois
scheel
rebuff
groupings
veto
prohibits
recommend
attached
simons
toraise
dilemma
withoutletting
posture
distillates
prici
disputed
sonatrach
prospecting
sahara
cfp
eked
sidelines
sounds
satisfy
dry
discouragin
parsky
uncontrolled
delete
david
mideastending
returning
retaliate
angry
retorts
denouncement
filled
sawhill
thomas
beating
priced
continual
inventories
narrowing
mary
lemons
pain
success
trezise
precursor
odds
chancy
manipulations
sufficiently
forgo
owes
philip
readily
manipulated
swaps
eckstein
brunt
recycled
edward
bear
analyses
bernstein
lessened
equilibrium
mill
profiting
suffering
reaction
technical
dissent
stake
deals
printed
defeat
overcome
records
climbed
evoked
responses
foreground
urgently
nasdaq
fell
plunged
essentially
ital
widely
formal
isolationist
employs
oppostion
sophisticated
interdependence
heed
hegemony
participating
extended
allies
wrangling
acceptable
clashes
night
burned
added
amount
puts
theministry
ord
rec
ministry
gathered
houari
airport
arrived
laugh
align
divergent
identify
italics
supplied
paragraphs
considerably
thatn
worsened
degree
mgr
wortreich
linehan
introduction
bur
expire
generate
pollution
purely
ideas
pradash
addressing
crowd
gupta
uttar
gandhi
untouchable
avid
election
anger
opponent
fifths
bargain
contend
regret
renewing
fully
defy
africans
responds
malawi
mauritius
lesotho
specialists
closing
botswana
thoughts
alleviating
machine
disastrous
crank
coodinating
outlines
rethinking
demanded
depending
holland
sitive
tober
oc
boycotted
shrugged
israelpolicy
rift
strate
disputeon
inflexible
gists
termsfor
ofcrude
gress
theunited
dampen
sepa
representa
rately
tive
bhutto
brother
moslem
asia
predominantly
islamic
restoration
emphasize
lahore
forge
converge
moslems
concedes
vetoed
recommitted
stricken
slim
outraged
thin
override
redistribution
intolerable
distressed
presenting
delegations
prepare
latins
revolutionary
installation
largely
monarchy
nationalizations
deposition
occasion
concessionaires
hardline
toughest
fahmy
ismail
saqqaf
golan
heights
seaboard
governmentt
breakdown
kenen
emile
van
intensified
hazards
princeton
lennep
lure
epidemic
prediction
resort
fanned
fever
bugs
denigrate
franz
threats
sharpen
silk
contraction
approves
rewritten
presidential
saigon
underwritten
announcing
severely
vuong
bac
establishes
visited
todav
arabiaannounced
backers
connection
donors
loaned
riza
repay
donations
annually
stubborn
version
standby
delaying
endangered
fought
thirds
md
staggers
features
marvin
attending
chance
mandel
harly
commonwealth
succeeded
happy
abdel
undercut
rahman
invites
oncredit
swaran
assuring
ore
singh
pfc
stolen
preston
assailant
mansion
helicopter
determined
penetrated
perceived
sandwich
hamburger
shelves
exhausted
flour
grocers
buns
scarce
bread
drafted
picket
dreadful
read
things
andrew
vincenti
gradual
battle
chilling
engineered
adamantly
riches
multiply
restraint
satisfied
rumored
elated
lengthy
hemisphere
changing
andisraeli
speaks
disengaged
advocating
imposing
couple
ullman
constitute
collision
facade
torpedo
heats
grisis
undoing
generous
iranians
calculate
forum
vigorously
impoverished
catastrophe
decides
criteria
establishing
delegation
intervals
attends
conduct
transfers
corns
reluctant
talked
liberal
flew
thorpe
phone
jeremy
watched
claridge
marine
alec
singer
paraphrase
yale
folk
optimist
settling
surged
touched
barrier
eager
abrasive
dissatisfactions
sectional
rejec
tally
store
curtailing
stabilized
confidential
assist
helmut
attractive
providing
drawn
ino
calley
receding
congratulated
harmless
pumps
cold
guardsmen
bail
immunity
freed
composed
cows
judah
shuttle
lion
secrecy
separating
persuasion
symptomatic
inconclusive
democracy
dispatch
theoretical
unbelievable
pampered
god
balancing
refine
telling
apoplectic
searches
materialize
ivory
grant
fraternite
steeply
siding
columnist
stepping
abdijan
matin
fostering
obatala
blacks
oligopolistic
fashion
imperatives
operates
constitutes
tools
triumph
hanover
eurocurrency
mfrs
platten
gabriel
undue
confident
donald
burdens
wriston
troubles
sweep
falters
democracies
plague
falter
accompanied
cutmaybe
duty
lawsuit
pan
airways
bears
notable
marlborough
lawyers
lasker
paintings
levine
surrogate
abstract
executors
expressionist
albee
consigning
rothko
lawyer
executor
reis
daughter
meyer
stir
gallery
defending
objections
purportedly
twenty
random
lacking
flatly
nacional
discussions
ventures
arb
salem
replenishment
recordings
tape
clair
rodino
explaining
upheld
vetoes
touch
rein
bankrupt
continuance
diplomat
watchers
mfd
wallace
deliberate
occasions
belittle
commentator
disappear
overdependence
atmosphere
outrages
pleases
leo
socialists
defeating
campaigning
edmond
sidizing
proceeds
willy
stoppage
trusts
greaeves
belgian
leburton
tindeman
garnered
profitless
angers
georges
tindemans
premiership
claes
precipitious
misfire
rhethorical
staffer
stephen
hound
nordlinger
hippopotamus
breaksasked
regulate
repealed
fpc
subcoms
town
heart
midland
unprofitable
fun
entrepeneurs
mittees
unintended
unplanned
stimulus
lining
blessing
proportion
disguise
motorist
wealth
dubious
johannes
supplemented
window
drawings
facility
hydrocarbons
outgoing
christian
promissory
radical
juan
hire
leftist
andres
book
architect
experimental
pablo
elect
alfonzo
rafael
carlos
debates
mpg
accurancy
sued
motors
mazda
dealerships
republic
enlarging
industrialists
gear
ocean
doctrines
hyper
carlin
furthering
ibrahim
panglossian
contemporary
petrodollars
petrodollar
followers
defray
doctrine
oweiss
inelastic
pangloss
interval
damping
ravenswood
staten
queens
elizabeth
queen
obtaining
retreats
solve
sea
referring
pretzels
clock
potatochip
chip
potato
pretzel
bakers
boon
potatoes
vegetable
stale
spical
creates
consumcrists
kehoe
edwin
advisors
sums
exempted
restrict
redress
laud
cessation
richardson
naming
consumerist
commerciall
loading
pursue
positioning
courses
compiling
destined
sheathing
ports
destinations
ofoil
donaldson
rhodesians
grew
portuguese
welcomed
climate
banlifting
protested
coordinating
echoes
prospective
stands
underscoring
hts
gromyko
arrange
veiled
presumption
llewellyn
inflationalry
shilling
greenspan
midyr
gary
abbas
amir
caution
hoveida
stray
district
hitchhiker
assuredly
waiting
seeds
sacred
hands
dogs
predecessors
destruction
investigated
transco
deferral
pennzoil
cancelled
cancellation
televised
nationally
maintained
emerged
treating
deduct
acquiring
capitalized
engineering
factory
fiction
write
deducted
intangible
reforming
arbitrary
collected
taxed
rid
expenses
capitalize
outlay
lasting
osorio
nickel
sectors
hanna
arana
guatemala
renegotiate
proceeding
exmibal
lingers
deferred
maneuvering
withheld
contest
goading
judiciary
hush
burglars
investigative
defendants
distrusting
statese
lessons
casting
significantly
treacherous
brightened
compoundign
pall
ides
bending
campaigned
caretaker
bust
decreed
slowness
ready
bidder
valid
frederick
preference
dent
subsidize
mordechai
eliminates
kreinin
flexible
worth
unloaded
disposing
